using ICEN2.白魔.技能数据;

namespace ICEN2.白魔.界面.Hotkey;

public static class 白魔Hotkey技能设置
{
    public static readonly Dictionary<string, uint> List = new()
    {
        { "闪灼", 技能id.闪灼 },
        { "天辉", 技能id.天辉 },
        { "法令", 技能id.法令 },
        { "神速咏唱", 技能id.神速咏唱 },
        { "即刻咏唱", 技能id.即刻咏唱 },
        { "无中生有", 技能id.无中生有 },
        { "狂喜之心", 技能id.狂喜之心 },
        { "安慰之心", 技能id.安慰之心 },
        { "苦难之心", 技能id.苦难之心 },
        { "白冲步", 技能id.以太变移 },
        { "闪飒", 技能id.闪飒 },
        { "神爱抚", 技能id.神爱抚 },
        { "豪圣", 技能id.豪圣 },
        { "醒梦", 技能id.醒梦 },
        { "营救", 技能id.营救 },
        { "神名", 技能id.神名 },
        { "神祝祷", 技能id.神祝祷 },
        { "医济/医养", 技能id.医济 },
        { "愈疗", 技能id.愈疗 },
        { "天赐祝福", 技能id.天赐祝福 },
        { "庇护所", 技能id.庇护所 },
        { "再生", 技能id.再生 },
        { "康复", 技能id.康复 },
        { "全大赦", 技能id.全大赦 },
        { "救疗", 技能id.救疗 },
        { "水流幕", 技能id.水流幕 },
        { "医治", 技能id.医治 },
        { "治疗", 技能id.治疗 },
        { "节制", 技能id.节制 },
        { "礼仪之铃", 技能id.礼仪之铃 },
        { "复活", 技能id.复活 },
    };
}